## Preview of Terraform changes in 83515b80e7c40409aacda8a683c022463ec3b2b3

### Changed Stacks

```bash
stacks/aws/envs/dev/k8s
stacks/aws/envs/dev/network
```

#### Terraform Plan

```terraform
terramate: Entering stack in /stacks/aws/envs/dev/k8s
terramate: Executing command "terraform show -no-color out.tfplan"

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "cluster-dev:default-20250724162006646600000011"
      + labels                 = {}
        tags                   = {
            "Environment" = "dev"
            "GithubOrg"   = "PcBarreto"
            "GithubRepo"  = "iac-multicloud"
            "ManagedBy"   = "Terraform"
            "Name"        = "default"
            "Owner"       = "Platform Engineering"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:905418047255:access-entry/cluster-dev/user/905418047255/cloud_user/c0cc1e9d-c532-302f-c285-68a8123e0aec" -> (known after apply)
      ~ created_at        = "2025-07-24T16:19:29Z" -> (known after apply)
      ~ id                = "cluster-dev:arn:aws:iam::905418047255:user/cloud_user" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-07-24T16:19:29Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::905418047255:user/cloud_user" -> "arn:aws:iam::905418047255:role/github" # forces replacement
        tags              = {
            "Environment" = "dev"
            "GithubOrg"   = "PcBarreto"
            "GithubRepo"  = "iac-multicloud"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Platform Engineering"
        }
      ~ user_name         = "arn:aws:iam::905418047255:user/cloud_user" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-07-24 16:19:30.091 +0000 UTC" -> (known after apply)
      ~ id            = "cluster-dev#arn:aws:iam::905418047255:user/cloud_user#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-07-24 16:19:30.091 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::905418047255:user/cloud_user" -> "arn:aws:iam::905418047255:role/github" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "c25589b9-97cb-4f00-a1dc-1b9ceb39bbf6"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::905418047255:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::905418047255:user/cloud_user" -> "arn:aws:iam::905418047255:role/github"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::905418047255:role/cluster-dev-cluster-20250724160945393400000003"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "GithubOrg"             = "PcBarreto"
            "GithubRepo"            = "iac-multicloud"
            "ManagedBy"             = "Terraform"
            "Owner"                 = "Platform Engineering"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
terramate: Entering stack in /stacks/aws/envs/dev/network
terramate: Executing command "terraform show -no-color out.tfplan"

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

<!-- Sticky Pull Request Commentpreview -->